Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_019/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 16.682ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 19.931ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.16ms   15.89ms 272.13ms   93.93%
    Req/Sec   252.33    178.62     1.04k    55.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.37ms
 75.000%   22.30ms
 90.000%   31.12ms
 99.000%   86.91ms
 99.900%  218.37ms
 99.990%  270.33ms
 99.999%  272.38ms
100.000%  272.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.199     0.000000            1         1.00
      13.999     0.100000         8502         1.11
      15.391     0.200000        17027         1.25
      16.495     0.300000        25589         1.43
      17.455     0.400000        33987         1.67
      18.367     0.500000        42487         2.00
      18.911     0.550000        46740         2.22
      19.535     0.600000        50971         2.50
      20.271     0.650000        55214         2.86
      21.167     0.700000        59491         3.33
      22.303     0.750000        63751         4.00
      22.975     0.775000        65834         4.44
      23.871     0.800000        67980         5.00
      25.055     0.825000        70101         5.71
      26.655     0.850000        72210         6.67
      28.431     0.875000        74335         8.00
      29.519     0.887500        75393         8.89
      31.119     0.900000        76445        10.00
      32.895     0.912500        77514        11.43
      34.815     0.925000        78574        13.33
      37.599     0.937500        79636        16.00
      39.679     0.943750        80166        17.78
      42.111     0.950000        80701        20.00
      45.055     0.956250        81226        22.86
      48.735     0.962500        81755        26.67
      54.143     0.968750        82285        32.00
      56.799     0.971875        82551        35.56
      59.263     0.975000        82816        40.00
      63.647     0.978125        83080        45.71
      67.839     0.981250        83358        53.33
      72.959     0.984375        83615        64.00
      75.135     0.985938        83745        71.11
      78.079     0.987500        83877        80.00
      83.519     0.989062        84010        91.43
      90.495     0.990625        84143       106.67
      98.111     0.992188        84276       128.00
     103.487     0.992969        84341       142.22
     111.871     0.993750        84408       160.00
     119.487     0.994531        84474       182.86
     127.615     0.995313        84540       213.33
     137.599     0.996094        84607       256.00
     142.591     0.996484        84640       284.44
     146.047     0.996875        84674       320.00
     152.831     0.997266        84706       365.71
     168.319     0.997656        84740       426.67
     178.943     0.998047        84773       512.00
     188.159     0.998242        84789       568.89
     200.959     0.998437        84806       640.00
     205.311     0.998633        84825       731.43
     213.887     0.998828        84839       853.33
     218.623     0.999023        84858      1024.00
     219.007     0.999121        84864      1137.78
     225.023     0.999219        84872      1280.00
     234.751     0.999316        84880      1462.86
     244.607     0.999414        84889      1706.67
     253.439     0.999512        84897      2048.00
     257.023     0.999561        84901      2275.56
     260.735     0.999609        84905      2560.00
     264.191     0.999658        84913      2925.71
     265.215     0.999707        84914      3413.33
     267.519     0.999756        84918      4096.00
     268.031     0.999780        84922      4551.11
     268.031     0.999805        84922      5120.00
     268.287     0.999829        84924      5851.43
     268.799     0.999854        84928      6826.67
     268.799     0.999878        84928      8192.00
     269.055     0.999890        84929      9102.22
     270.335     0.999902        84930     10240.00
     270.591     0.999915        84935     11702.86
     270.591     0.999927        84935     13653.33
     270.591     0.999939        84935     16384.00
     270.591     0.999945        84935     18204.44
     270.591     0.999951        84935     20480.00
     270.591     0.999957        84935     23405.71
     270.591     0.999963        84935     27306.67
     272.383     0.999969        84938     32768.00
     272.383     1.000000        84938          inf
#[Mean    =       22.165, StdDeviation   =       15.886]
#[Max     =      272.128, Total count    =        84938]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89744 requests in 3.00m, 73.01MB read
Requests/sec:    498.53
Transfer/sec:    415.28KB